app/Models/ModelPersyaratan.php

    public function allData()
    {
        return $this->db->table('tbl_persyaratan')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_persyaratan`