app/Models/ModelAuth.php

    public function loginTendik($username, $password)
    {
        return $this->db->table('tbl_tendik')->where([
            'username' => $username,
            'password' => $password
        ])->get()->getRowArray();
---
SELECT *
FROM `tbl_tendik`
WHERE `username` = 'admin'
AND `password` = '1234'