app/Models/ModelDosen.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_dosen`
---
    public function jumlahDosen()
    {
        return $this->db->table('tbl_dosen')
            ->countAllResults();