app/Models/ModelProdi.php

    public function jumlahProdi()
    {
        return $this->db->table('tbl_prodi')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_prodi`